# InvalidPowerFactorValue Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..InvalidPowerFactorValue Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
The value for Power Factor must be between 0 and 1.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidPowerFactorValue { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidPowerFactorValue As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidPowerFactorValue {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace